<a id="0"></a>

# <p style="padding:10px;background-color:#87CEEB ;margin:10;color:#000000;font-family:newtimeroman;font-size:100%;text-align:center;border-radius: 10px 10px ;overflow:hidden;font-weight:50">Assignment  22: Pandas Basics - Utkarsh Gaikwad</p>

[Assignment pdf link](22%20Feb_AssQ.pdf)

<a id="1"></a>

# <p style="padding:10px;background-color:#87CEEB ;margin:10;color:#000000;font-family:newtimeroman;font-size:100%;text-align:center;border-radius: 10px 10px ;overflow:hidden;font-weight:50">Question 1</p>

## Question 1: Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.
---

## Answer:

In [1]:
import pandas as pd
series1 = pd.Series([4,8,15,16,23,42])
print(series1)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

<a id="2"></a>

# <p style="padding:10px;background-color:#87CEEB ;margin:10;color:#000000;font-family:newtimeroman;font-size:100%;text-align:center;border-radius: 10px 10px ;overflow:hidden;font-weight:50">Question 2</p>

## Question 2: Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.
---

## Answer:

In [2]:
# Creating a list contain square for first 10 Natural numbers
l2 = [(i+1)**2 for i in range(10)]
print(l2)

[1, 4, 9, 16, 25, 36, 49, 64, 81, 100]

In [3]:
# Creating Pandas Series for above list
series2 = pd.Series(l2)
print(series2)

0      1
1      4
2      9
3     16
4     25
5     36
6     49
7     64
8     81
9    100
dtype: int64

<a id="3"></a>

# <p style="padding:10px;background-color:#87CEEB ;margin:10;color:#000000;font-family:newtimeroman;font-size:100%;text-align:center;border-radius: 10px 10px ;overflow:hidden;font-weight:50">Question 3</p>

## Question 3: Create a Pandas DataFrame that contains the following data:

|Name  |Age  |Gender|
|:----:|:---:|:----:|
|Alice |25   |Female|
|Bob   |30   |Male  |
|Claire|27   |Female|

## Then Print the DataFrame

---

## Answer:

In [4]:
# Creating a dictionary with 'Name', 'Age' and 'Gender' as Key and rows as list in values
dct3 = {
    'Name':['Alice','Bob','Claire'],
    'Age':[25,30,27],
    'Gender':['Female','Male','Female']
}

In [6]:
# Converting Dictionary to DataFrame
df3 = pd.DataFrame(dct3)
df3

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

<a id="4"></a>

# <p style="padding:10px;background-color:#87CEEB ;margin:10;color:#000000;font-family:newtimeroman;font-size:100%;text-align:center;border-radius: 10px 10px ;overflow:hidden;font-weight:50">Question 4</p>

## Question 4: What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.
---

## Answer:

### A DataFrame in pandas is a two-dimensional labeled data structure with columns of potentially different types. It is similar to a spreadsheet or a SQL table, where data is organized in rows and columns. Each column can contain a different type of data, such as numbers, strings, or dates.

### On the other hand, a pandas Series is a one-dimensional labeled array that can contain data of any type, such as integers, strings, or booleans. It is similar to a column in a DataFrame.

### Below is Example of a Pandas DataFrame which is 2 dimensional in nature

In [7]:
# Dictionary for pandas DataFrame
dct4 = {
    'emp_id':[100,101,102],
    'name':['Utkarsh','Krish','Aditi'],
    'dept':['ML Engineer','DevOps','Testing'],
    'email':['utkarsh@test.com','krish@test.com','aditi@test.com'],
    'favourite_subject':['Calculus','Statistics','Six Sigma']
}

df4 = pd.DataFrame(dct4)
df4

   emp_id     name         dept             email favourite_subject
0     100  Utkarsh  ML Engineer  utkarsh@test.com          Calculus
1     101    Krish       DevOps    krish@test.com        Statistics
2     102    Aditi      Testing    aditi@test.com         Six Sigma

In [8]:
type(df4)

pandas.core.frame.DataFrame

### Example of Series below . I have Selected dept column to show as series

In [9]:
series4 = df4['dept']
print(series4)

0    ML Engineer
1         DevOps
2        Testing
Name: dept, dtype: object

In [10]:
type(series4)

pandas.core.series.Series

<a id="5"></a>

# <p style="padding:10px;background-color:#87CEEB ;margin:10;color:#000000;font-family:newtimeroman;font-size:100%;text-align:center;border-radius: 10px 10px ;overflow:hidden;font-weight:50">Question 5</p>

## Question 5: What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?
---

## Answer :

### Creating a sample DataFrame to work with

In [24]:
# create sample dataframe with missing values
data5 = {'name': ['Utkarsh', 'Aditi', 'Nitin', 'Bhushan', 'Kritika'],
        'age': [25, 30, None, 40, 35],
        'city': ['Pune', 'Mumbai', 'Delhi', None, 'Banaras'],
        'category': ['A', 'B', 'A', 'B', 'A'],
        'sales': [400, 200, 250, 150, 450],
        'date': ['2022-01-01', '2022-01-02', '2022-01-03', '2022-01-04', '2022-01-05']}
df5 = pd.DataFrame(data5)
df5

      name   age     city category  sales        date
0  Utkarsh  25.0     Pune        A    400  2022-01-01
1    Aditi  30.0   Mumbai        B    200  2022-01-02
2    Nitin   NaN    Delhi        A    250  2022-01-03
3  Bhushan  40.0     None        B    150  2022-01-04
4  Kritika  35.0  Banaras        A    450  2022-01-05

### 1. dropna(): Removes any row with missing values.

In [25]:
dropped_df5 = df5.dropna(axis=0)
dropped_df5

      name   age     city category  sales        date
0  Utkarsh  25.0     Pune        A    400  2022-01-01
1    Aditi  30.0   Mumbai        B    200  2022-01-02
4  Kritika  35.0  Banaras        A    450  2022-01-05

### 2. fillna(): Fills missing values with a specified value or method.

In [26]:
filled_df5 = df5.fillna(0)
filled_df5

      name   age     city category  sales        date
0  Utkarsh  25.0     Pune        A    400  2022-01-01
1    Aditi  30.0   Mumbai        B    200  2022-01-02
2    Nitin   0.0    Delhi        A    250  2022-01-03
3  Bhushan  40.0        0        B    150  2022-01-04
4  Kritika  35.0  Banaras        A    450  2022-01-05

### 3. groupby(): Groups the DataFrame by one or more columns and allows for aggregation of the data.

In [27]:
sales_mean = df5.groupby('category').mean(numeric_only=True)
sales_mean

           age       sales
category
A         30.0  366.666667
B         35.0  175.000000

### 4. sort_values(): Sorts the DataFrame by one or more columns.

In [28]:
# Sorting by Sales in descending order
df5.sort_values(by='sales',ascending=False)

      name   age     city category  sales        date
4  Kritika  35.0  Banaras        A    450  2022-01-05
0  Utkarsh  25.0     Pune        A    400  2022-01-01
2    Nitin   NaN    Delhi        A    250  2022-01-03
1    Aditi  30.0   Mumbai        B    200  2022-01-02
3  Bhushan  40.0     None        B    150  2022-01-04

<a id="6"></a>

# <p style="padding:10px;background-color:#87CEEB ;margin:10;color:#000000;font-family:newtimeroman;font-size:100%;text-align:center;border-radius: 10px 10px ;overflow:hidden;font-weight:50">Question 6</p>

## Question 6: Which of the following is mutable in nature Series, DataFrame, Panel?
---

## Answer:

### In pandas, Series and DataFrame are mutable in nature.

### Panel is considered immutable.

### That means, Series and DataFrame objects can be modified after they are created, and any changes made to them will be reflected in the original objects. On the other hand, Panel objects are generally not modified once created, and any changes made to them usually result in the creation of a new object.

### Note that while Series and DataFrame objects are mutable, it is generally recommended to avoid modifying them in place, as this can lead to unexpected results and errors. Instead, it is often better to create a new object with the desired modifications.

<a id="7"></a>

# <p style="padding:10px;background-color:#87CEEB ;margin:10;color:#000000;font-family:newtimeroman;font-size:100%;text-align:center;border-radius: 10px 10px ;overflow:hidden;font-weight:50">Question 7</p>

## Question 7 : Create a DataFrame using multiple Series. Explain with an example.
---

## Answer:

### By using concat() method you can merge multiple series together into DataFrame. This takes several params, for our scenario we use list that takes series to combine and axis=1 to specify merge series as columns instead of rows. Note that using axis=0 appends series to rows instead of columns.

In [32]:

import pandas as pd
# Create pandas Series
courses = pd.Series(["Data Science Masters","Java with DSA","Full Stack Web Development"])
fees = pd.Series([7000,7500,8000])
discount  = pd.Series([3500,3000,2500])

# concat() supports to combine multiple series.
df7=pd.concat([courses,fees,discount],axis=1)
df7.columns = ['course','fees','discount']
df7

                       course  fees  discount
0        Data Science Masters  7000      3500
1               Java with DSA  7500      3000
2  Full Stack Web Development  8000      2500